{"title":"ウミーベを退職してフリーランスになったのでこれからの話","description":"こんにちは。mya-ake（みゃけ）というハンドルネームで活動してる渋田です。1 月末で今まで勤めたウミーベを退職しました。そこでいわゆる退職エントリってやつを書きました。","body":"<p><img src=\"/images/i-became-a-freelance/asahi.jpg\" alt=\"\" draggable=\"false\"></p>\n<h2 id=\"筆者について\">筆者について</h2><p>こんにちは。mya-ake（みゃけ）というハンドルネームで活動してる渋田です。\n1 月末で今まで勤めたウミーベを退職しました。\nそこでいわゆる退職エントリってやつを書きました。</p>\n<h2 id=\"ウミーベという会社にて\">ウミーベという会社にて</h2><p><a href=\"https://umee.be\">ウミーベ</a>は「釣りを、やさしく」をコーポレートビジョンに掲げた釣りに関する企業です。\n僕は 2016 年の 6 月に入社しました。\nその頃は僕もいれて 3 人の会社でほんとこれからというベンチャー企業でした。</p>\n<h3 id=\"入社経緯\">入社経緯</h3><p>ウミーベに入社するきっかけは CEO の<a href=\"https://twitter.com/kazzwatabe\">カズワタベ</a>さんと飲みに行ったことでした。\n元々たまにランチなど行ったりして事業の話を聞いておもしろいことをやってるなーと思ってました。</p>\n<p>その当時、僕自身は福岡に移住してから（4,5 年ぐらい前）一緒に仕事をしてた人と合同会社を設立し、その会社の CTO という立場でした。\nただ会社としての方針やエンジニアとしての僕の存在価値とかその辺で悩んでる時期でもありました。<small><a href=\"https://twitter.com/mya_ake/status/1090984168949837824\">その頃の話をちょっとだけしたツイート</a></small></p>\n<p>そんなときに誘ってくださり、そのまま社員としてウミーベに入社することを決めました。</p>\n<h3 id=\"ウミーベでやったこと\">ウミーベでやったこと</h3><p>ウミーベにはフロントエンドエンジニアとして入社しました。\n入社後は<a href=\"https://tsuriho.com\">ツリホウ</a>と<a href=\"https://tsuriba.camera\">ツリバカメラ web 版</a>のリニューアルに携わりました。\nまたツリバカメラのアプリ向けの天気情報の収集などの一部マイクロサービスをサーバーレスで作りました。</p>\n<p>僕が最初に行った大きい仕事はツリホウのリニューアルでした。\n当時月間 100 万 PV ぐらいのメディアサイトで、そのときにホスティングしていたサーバーはかなり遅くなっていました。\nそこでデザインのリニューアル前にの AWS に移管して運用していこうというプロジェクトが始まりました。\n予算に収めつつアクセスを捌く必要があったので、 KUSANAGI を使用し、カタログスペック的に捌けるだろうという推測のもと移管しました。\nただ蓋を開けてみるとピーク時は捌ききれませんでした（ちゃんと負荷計測しろよって話ですね 😇）。\n数日後に AWS を止め、WordPress の専用サーバーへと移管し事なきを得ました。\n今思うと DB のコネクション数が問題だったのでは？という気もしますが、まあそのときを再現できないのでどうやったら捌けたのかは定かではありません。\nただ餅は餅屋に依頼すべきだなとそのとき強く思いました。</p>\n<p>その後も技術的な選定なども僕の裁量でやらせてもらいました。\nツリバカメラの web 版リニューアルでフロントエンドのフレームワークは Angular と Vue.js を検討しました。最終的に人材面（Angular が扱えるようになる人より Vue.js が扱えるようになる人の方が多そう）を決め手に Vue.js を採用しました。（当時の選定の話：<a href=\"https://mya-ake.com/slides/how-to-choose-angular-react-vue-svelte-riot\">Angular, React, Vue, Svelte, Riot の個人的な選び方</a>）</p>\n<p>またサーバーレスのマイクロサービスとかも当時（2 年前）ではあまり事例がない感じだったと思います。\nそんな挑戦的な技術選定もでき、とてもよい環境だったと思います。</p>\n<p>※もちろん技術選定もやってみたいからだけというわけだけでなく、この技術を使うとサーバーコスト面とかの優位性があるみたいな話はしてます。</p>\n<h3 id=\"会社の動き\">会社の動き</h3><p>僕が退職するまでの間に会社として大きく動きました。\n2 年半前に 1 億近い資金調達を行い、そして半年ほど前クックパッドに買収されました。\nそのような会社の動きを中から見れたのはとてもいい経験になりました。</p>\n<p>ちなみに最近 Twitter とかでストックオプションの話題があったのでその話も少し書いておくと、買収されてストックオプションはなくなりました。その代わり賞与が出ました。\n個人的にはそこまで期待してたわけでもなく完全になくなったというわけでもないのでその名のとおりボーナスラッキーという感じでした。</p>\n<h2 id=\"なんで辞めたのか\">なんで辞めたのか</h2><p>辞めた理由は大きく 4 つです。</p>\n<ul>\n<li>仕事の依頼が来るようになってきた</li>\n<li>自分を鍛えるための期間がほしかった</li>\n<li>OSS の活動時間を増やしたい</li>\n<li><strong>子供ができた</strong>🎉</li>\n</ul>\n<p>はい、子供ができました 👶 現在妊娠 5 ヵ月目ぐらいです ☺️<br>（嫁はウニちゃんと名付けて毎日呼びかけています）</p>\n<p>ってことで単純に収入を上げていきたいというのが大きな理由です。\n前述した会社の動きは辞める動機にはつながっていません。完全に個人的な事情によるものです。</p>\n<p>また子供ができたのに合わせたようにお仕事の依頼が来るようになってきました。\n再びフリーランスになるのもありだなーっと思うようになりました。</p>\n<p>そしてそろそろ自分を鍛える時間がほしいという想いが募っていました。\n漠然とこのままじゃいかんみたいな危機感がありました。\nざっくり自分の鍛えたいところとしては</p>\n<ul>\n<li>監視系の知識</li>\n<li>統計の知識</li>\n<li>アーキテクチャの知識</li>\n<li>バックエンドの知識の入れ直し</li>\n<li>Golang / Julia / Elixir / Rust あたりの勉強</li>\n<li>筋トレ</li>\n<li>英語</li>\n</ul>\n<p>とかとか。\n自由に動ける時間増やして修行に多く時間を使いたいなとという感じです。</p>\n<p>あと修行にも近いのですが個人で OSS を出すようになってきました。\nとくに力を入れているのが VuePress ベースのコンポーネントカタログです。\n詳細は<a href=\"https://mya-ake.com/slides/creating-catalog-of-components\">このスライド</a>を見ていただくとして、早く v1 としてリリースしたいです。</p>\n<p>このような身の回りの動きや想いからフリーランスになることを決断しました。</p>\n<h2 id=\"これからの話\">これからの話</h2><p>しばらくはフリーランスとしてやっていく予定です。\n2 回目の完全フリーランスです。\nしばらくと書いてあるように数ヶ月後には就職も視野に入れています。\n最初から就職しなかった理由はフリーランスでも仕事があったのと修行期間がほしかったからです。</p>\n<h3 id=\"修行について\">修行について</h3><p>修行内容は前述しましたが、もうちょっと深掘りします。</p>\n<p>僕を知ってるという人はお前フロントエンドエンジニアだよな？って思う方も多いかもしれません。\nそれなのにフロントエンドの修行はしないの？っていう疑問を持つと思います。</p>\n<p>僕自身としては web のエンジニアという認識で活動してます。\nフロントエンドの人間っぽいのはここ数年で出てきた PWA やフレームワークなどがおもしろいなと思って追っかけていたからです。\nその過程で技術書典に出展したり、日々のイベントの登壇でフロントエンドの話をしてたので、そんなイメージになったのかなーと思ってます。\nじゃあそのままフロントエンドを極めていってもいいんじゃない？っていう話でもあるのですが、僕の興味と生存戦略的に他の知識も入れておきたいという思いがあります。</p>\n<p>僕はサービスを最適に運用してくためには、サービスに関わる技術の知識が全体的に必要であるという考えを持っています。\n当たり前と言えば当たり前ですが、全体を知っていることでボトルネックになる箇所を事前に対処したり、開発の過程で出てくる諸問題に対応できます。<br>たとえば、フロントエンドとバックエンドを知っていると、エラー発生時に問題となりうる箇所がおおよそ推測できます。問題の切り分けのポイントがわかるので、解決までの最短の道を選びやすくなります。\nこのスキルは有限な工数の中でかなり生きてくるものではないでしょうか。</p>\n<p>このような経験は元々バックエンドエンジニアだった自分ならではという実感もあったので、今後も全体を見れるエンジニアとしてやっていきたいという感じです。\nただそんな中でもフロントエンドに特化してる形にはなっていくとは思います。フロントエンドに関しては OSS 周りで関わってくるので勝手に鍛えられると思い、とくに鍛えたい項目にいれてないです。</p>\n<p>あと他の特筆すべき修行があるとすれば筋トレと英語です。\n筋トレは運動したいのと鍛えたいから、英語は OSS 活動する上で必要ですし、英会話もできるようになりたいなというやつです。</p>\n<h3 id=\"フリーランスの仕事について\">フリーランスの仕事について</h3><p>具体的にどういう仕事をするかについてです。\n今のところ考えているのは次の 3 つです。</p>\n<ul>\n<li>サービス開発・改善</li>\n<li>技術顧問・相談役</li>\n<li>プロトタイピング・研究</li>\n</ul>\n<p>サービス開発・改善はそのままなのですが、サービスの開発・改善を開発リリースとしてお手伝いをさせてください。</p>\n<p>技術顧問・相談役は開発リリースというよりも僕の知識経験も元にお手伝いさせてください。\n今のところ<a href=\"https://diffeasy.com\">diffeasy</a>さんにてフロントエンドの技術顧問をさせていただいております。\n新しい風が吹くようになったとおっしゃっていただけるなどご好評なようです。\nいい影響をもたらす可能性が高いのでご依頼お待ちしております。</p>\n<p>プロトタイピング・研究は需要があるのかはわからないですが、仕事候補に加えています。\nたとえば新規サービスのプロトタイプだけ作ってほしい、とある技術を試したいけど社内リソースを使って検証してる時間がないというところ向けに考えてるものです。<br>サービス開発・改善と分けている理由としては前金+成功報酬という形を取りたいからです。</p>\n<p>次に金額面ですが 5 万/日（7 時間）を基準に設定しています。\n内容や条件により前後させることも可能です。</p>\n<p>今のところありがたいことに 3 月いっぱいまでは仕事は埋まっています。\n4 月以降はまだ具体的な話が決まっていないので、もしご依頼があればお待ちしています。</p>\n<h3 id=\"求職について\">求職について</h3><p>子供の出産予定日が 7 月末ごろなので、その 2,3 ヵ月前か 2 ヵ月後以降ぐらいを目処に検討しています（フリーランスの仕事の具合も見て）。\n前だと出産日や育休とかなんかその辺が会社にとっても面倒そうなので、後にする可能性が高いです。\n入社して間もなくても育休とか取れるよ！って会社さんだと嬉しいですが、できれば双方に取ってよい形にしたいです。</p>\n<p>希望条件（徐々に追記するかも）</p>\n<ul>\n<li>福岡勤務</li>\n<li>フレックス勤務（リモート可だと嬉しい）</li>\n<li>希望年収 600 万円以上</li>\n<li>開発または研究業務</li>\n<li>副業可</li>\n</ul>\n<p>スペック面</p>\n<ul>\n<li>直近のスキル<ul>\n<li>JavaScript / TypeScript / HTML / CSS</li>\n<li>Vue.js / Nuxt.js（Angular / React も多分書ける）</li>\n<li>PWA</li>\n<li>Node.js</li>\n<li>AWS<ul>\n<li>Lambda メインですが EC2 などのコンピューティングサービス系も扱えます</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>昔やってた・文字通りちょっとできるスキル（細かく書くとムダにスペース使うのでちょっとだけ）<ul>\n<li>Spring Boot</li>\n<li>MySQL / MariaDB</li>\n<li>Elasticsearch / Redis</li>\n</ul>\n</li>\n<li>勉強会・イベント・コミュニティ系<ul>\n<li><a href=\"https://frontend-conf.fukuoka.jp\">フロントエンドカンファレンス福岡 2018</a> 運営委員長</li>\n<li><a href=\"https://v-fukuoka.connpass.com\">v-fukuoka</a>代表（Vue.js のコミュニティ）</li>\n<li><a href=\"https://ng-fukuoka.connpass.com\">ng-fukuoka</a>オーガナイザー（Angular のコミュニティ、最近活動できない）</li>\n<li><a href=\"https://cdg.connpass.com\">chibi-developr</a>でいろいろ</li>\n<li>その他はこちら -&gt; <a href=\"https://connpass.com/user/TatsuyaShibuta/open/\">主催イベント一覧</a></li>\n</ul>\n</li>\n<li>登壇・執筆歴<ul>\n<li><a href=\"https://event.shoeisha.jp/devsumi/20180906\">Developers Summit 2018 FUKUOKA</a></li>\n<li><a href=\"https://www.amazon.co.jp/dp/B07HXM3S1D\">現場で使える Vue.js tips 集</a></li>\n<li>LT とかはこちら -&gt; <a href=\"https://mya-ake.com/slides\">これまでのスライド一覧</a></li>\n</ul>\n</li>\n</ul>\n<p>年収に関しては福岡相場を調べてないので適正価格かはわからないのですが、数年前に平均 420 万円とかいう話を聞いたのでこれぐらいが個人的に現実的なのかなーと考えました。</p>\n<p>イベント系の経験が多いので、企業イベントをやってる会社さんだとそこら辺でも活躍できるかもです。\nあとイベント開いて勝手に発表してくるので、会社の宣伝とかしてきます。</p>\n<h2 id=\"おわりに\">おわりに</h2><p>ほんとにウミーベではいろいろ経験させてもらえたので、すごく感謝しています。\nまた働き方の自由度も高くフロントエンドカンファレンスや技術書典の時期は昼間でも活動できたりして助かることも多かったです。\n改めてありがとうございました。</p>\n<p>ちなみにウミーベはその名の通り海辺にありオフィスからの眺めはとてもよいです。\nお昼に食べた焼きそばは格別でした。</p>\n<p><img src=\"/images/i-became-a-freelance/yakisoba.jpg\" alt=\"\" draggable=\"false\"></p>\n<p>これからは当面フリーランスのエンジニアとしてやってくので改めてよろしくお願いします！</p>\n<p>そしてよくあるほしいものリストなるものも作ってみました -&gt; <a href=\"http://amzn.asia/iCLZtf3\">ほしいものリスト</a></p>\n<p>あと嫁（<a href=\"https://twitter.com/mi_upto\">mi</a>）が商業出版したのでこちらもよろしくお願いします！<br><a href=\"https://www.amazon.co.jp/dp/B07N3PNKHB\">Chrome Developer Tools 入門</a></p>\n\n<p>そういえば会社に自分の釣具を置いてきてしまったことを思い出しました。\n取材とかに活用してくれると嬉しいです。</p>","thumbnail":"/images/i-became-a-freelance/asahi.jpg","twitterCardType":"summary","createdAt":"2019-02-08"}