{"title":"1年間続けたフリーランスをやめてメルカリに入社した人の話","description":"メルカリの入社エントリも兼ねた近況報告。","body":"<h2 id=\"はじめに\">はじめに</h2><p>こんにちは。mya-ake（みゃけ）というハンドルネームで活動してる渋田です。\n知ってる人も多いと思うんですが、メルカリ（福岡拠点）に入社していました。\n入社したのが2月だったのでなんだかんだもう5か月は経ちますね。</p>\n<p>ほんとはすぐ入社エントリを出す予定だったんですが、途中まで書いたやつの続きを書く気にならなくてずるずる来た感じです。\n息子が産まれて1年経った日に、なんかエモい気持ちになったのでよし書くかと一念発起して、半分ぐらい書いてたやつを消して新しく書き始めました。</p>\n<p>個人的には入社エントリっていうより近況報告的なのをしたいなと思って書いてます。</p>\n<h2 id=\"メルカリに入社した\">メルカリに入社した</h2><p>一応入社エントリなので、それっぽいことも書いておきます。</p>\n<p>1年ほどフリーランスをやって、それからメルカリに入社しました。\n最初から長くフリーランスをやるつもりもなくて、こっそり?就職活動していました。<br>そもそもどこかの会社に入りたいというモチベーションの起源ですが、自分のライフステージの変化によるところが大きいです。\n子が産まれたというのもありますが、次はマイホームを建てようと家族で決めました。\n自分自身も今年で30歳となり、35年ローンを組むとなると払い終わるのは65歳です。\nそれを考えると30歳は1つの節目だなと思いました。\n（ただ、35年かけて住宅ローンを払いたくないので、住宅ローン減税の期間が終わったらガンガン繰り上げ返済するつもりでいます）\nあまり住宅ローンに詳しいわけではありませんが、ざっくり見た感じ就職していないと不利だなという気持ちがありました。\nそういうこともあり、就職したいという第一のモチベーションは住宅ローンでした。</p>\n<p>どうしてメルカリなのかという話ですが、技術的な面もありますし、福利厚生的な面もあります。\n筆者自身はフロントエンドエンジニアの経歴が長くなってきていますが、元はバックエンドエンジニアだったので、バックエンドも触れるような環境に行きたいなというのがありました（クロスファンクショナルな感じは福岡拠点だけかもしれない）。\nまた、多くのエンジニアがいる環境にいたことがなく、エンジニアが多くいる環境ではどのようにプロジェクトを回しているのかなども気になっていました（新卒で入った東京のSIerにはエンジニアはいっぱいいましたが、自分自身のキャリアは福岡に移住してからだと思ってるので、新卒の頃は考えてないものとする）。\nあとはマイクロサービスやReactやGolangなどなど触ってみたいものが揃っているなどもありました。<br>福利厚生面ですが、Sick Leaveや子の看護休暇などがあるというのが大きかったです。\n他の会社さんも導入されているところはあると思いますが、メルカリは早くに導入されていたのが印象的で、各人の家庭に対するケアも手厚そうなんだろうなーっと勝手に期待していたところもあります。</p>\n<p>以上がメルカリ入社に対する動機みたいなものです。\n次は入ってみてどうなのかって話を書きます。</p>\n<h2 id=\"メルカリに入って実際どう？\">メルカリに入って実際どう？</h2><p>日々楽しくやっています。\nミスマッチ的なものも現状感じておらず入ってよかったなと感じています。</p>\n<p>今は、はじめてReactでがっつりプロジェクトを作ってて、日々学びがあって楽しいです。\n具体的な技術の話も書きたいんですが、どこまで書いていいかわからないので、表に出たときにでも会社の技術ブログに書こうかなって思ってます。\nそれなりにおもしろいことしてんなーって思ってるので、早く書きたいという気持ちです。</p>\n<p>福利厚生面についてはほんとに助かる案件があって、就職しててよかったとなりました。\n3月にサイトメガロウイルス性肝炎というやつにかかり、1か月間ほど37~39度の熱が出続けていました。\n早い人は1週間で治ると聞いていたので、解熱剤飲みつつ仕事したりSick Leaveで休んだりしてたんですが、まあどうにも熱が下がらないので5日ほど入院しました。\n入社して2か月目というタイミングだったんですが、Sick Leaveも7日あり、有給も10日付与されていたので、収入面でマイナスになることなく乗り切ることができました。（多分最速でSick Leave使いきった人になったんじゃないかな。知らんけど。）\nこれはほんとに会社に感謝でした。\nフリーランスだったときにかかっていたらと思うとぞっとしますね。</p>\n<p>また、子の看護休暇も恩恵にあずかれてます。\nちょうど最近、突発性発疹というものを発症して、2日半ほど看護休暇を使いました。\n子どもの体調が悪いと親ってすげー大変なんだなってのを実感して、これからはなるべく健康でいてくれと切に願ってます。\n（突発性発疹については後述しますね）</p>\n<p>総括すると「良い」の一言っすね。\n悪い部分がないのかって話なんですが、まあ1つのプロダクトを複数チーム、複数マイクロサービスで動かしているので、チーム間のやりとりでロスが発生して、スムーズに事が進まないというのはあると思います。\nこの辺りのいい解決法がないかと考えたりもするのですが、今のところこれといったアイデアはないです。\nこういった話もあるので、チーム間のやり取りが苦手という人には合わない環境かもしれません。<br>あと組織の編成は頻度高めに変わっていってるなというのは感じます。\nこれがいいか悪いかは人によると思いますが、個人的には時代や社員に合わせて組織を変えられるというのはいいことなのではと思います。\nただ現場には混乱が生じることもあると思うので、そのあたりのバランスは難しいだろうなとも思います。\n（組織について語る知見を持ってないのですごい雑に意見言ってるだけなので優しい目で見てください）</p>\n<p>実際どう？って話はこんなところでしょうか。</p>\n<h2 id=\"入社エントリとしてのまとめ\">入社エントリとしてのまとめ</h2><ul>\n<li>楽しくやってます</li>\n<li>入ってよかった</li>\n<li>福利厚生面でとても助かる出来事が多い</li>\n</ul>\n<p>ここからは近況的な小ブログが続きます。\n読みたい人だけどうぞ。</p>\n<h2 id=\"近況\">近況</h2><h3 id=\"マイホームを建てる\">マイホームを建てる</h3><p>メルカリに入社したタイミングぐらいからマイホームを建てようと奮闘してます。\nホームメーカーも決め、土地も篠栗で見つかり、現在のステータスは間取りを作るです。</p>\n<p>この間取りがほんとに難しいです。\n一応自由設計住宅なので、自分たちが希望する間取りで作れます。\nただ、家の強度や法律面からできない間取りも存在してとても苦しめられています。</p>\n<p>間取りはホームメーカーの方から提案してくれるのでは？と当初は思っていましたが、やはり自分たちが住む家なので自分たちの希望を叶えようとすると自分たちで作るほうが効率がいいです。\nただそうすると自分たちでこの間取りなら強度大丈夫かなとか、採光大丈夫かなとか考える羽目になり頭を悩ませてきます。\n（採光は人が生活する部屋には外からの一定量の光を取り入れないといけないという縛りです。窓のない6帖の部屋などは作れないです。びっくりですよね。（地下室がどういう扱いになるかは知らん））</p>\n<p>結局僕ら夫婦は自分たちの力だけで作るのに限界を感じて、セカンドオピニオン(※1)に依頼を出しました。\n一級建築士の方にお願いしたのですが、やはり餅は餅屋というように自分たちの発想にない間取りが届きました。\n現在は届いた間取りをベースにホームメーカーと建築可能な間取り(※2)に落とし込んでいます。</p>\n<p>※1 <a href=\"https://www.2ndplanning.org\">セカンドプランニング</a>さんにお願いしました<br>※2 ホームメーカーによって実現可能な間取りというのが存在します。建築方法の違いや使っている材質などによります。決して届いた間取りが実現不可能だったというわけではありません。</p>\n<p>ざっくり、マイホームを建てる件についてまとめると。\nこれから家を建てるという方は、セカンドオピニオンに依頼してみるとよりよい間取りができあがる可能性が高いので、個人的にはお金を払ってでも依頼するのがよいと考えます。\nなにせ高い買い物なので、よりよいものにする手は可能な限り取っておいて損はないと思います。<br>またマイホームを建てるのはわからないことばかりです。\n本当に今まで知らなかったことばかりなので、先に家を建てた知り合いに聞けることはどんどん聞いていくのがよいです。\n自分もかなり助けられているので、これから家を建てる人の役に立てたらなーと思います。</p>\n<p>ちなみに篠栗には福岡で著名な<a href=\"https://twitter.com/foxtrackjp?s=20\">水耕栽培キツネエンジニア</a>が住んでらっしゃたりするので、将来的にエンジニアの人にとって篠栗は面白い場所となるかもしれません。\nということでみんな篠栗に住もう！</p>\n<h3 id=\"突発性発疹\">突発性発疹</h3><p>つい最近、1歳になった息子がかかりました。\nざっくりどういう病気かというと</p>\n<ul>\n<li>ほとんどの人が小さい頃にかかる</li>\n<li>40度ぐらいの熱が3日続く</li>\n<li>熱が下がった後、赤い発疹が3日ほど出る</li>\n<li>熱が出ている間は割と機嫌がいいが、発疹が出ている間はとても機嫌が悪い</li>\n<li>不機嫌病とも言われるらしい</li>\n</ul>\n<p>とてもツラい日々でした。。。\nこの記事を書いてるときにはほぼ発疹も引いて、ようやく日常が戻ってきたという感じです。</p>\n<p>ほんとに発疹が出始めてからは人が変わったように泣きわめく時間が多かったです。\nしかも夜に多く、自分たちが寝る直前や寝てる最中に泣きわめいていました。\nたいてい泣くときはお腹空いたや眠いなどなのですが、このときはなにをしても泣き止みません。\n最終的には夫婦で抱っこして歩くというのを泣き止むまで繰り返してました。\n長いときは2時間近く泣き続けており、次の日は夫婦で筋肉痛になりました。</p>\n<p>ほんとにこの子はどうしてしまったんだ、悪魔でも乗り移ったのではないかと思うぐらいの変貌です。\n終わりは来るのかという絶望に追いやられ、精神的にとてもきついです。</p>\n<p>僕ら夫婦は2人とも可能な限り仕事の休みを取って対応しました。\nこれからかかる子を持つ人たちに言いたいことは、突発性発疹と診断されたら家族総出の総力戦の構えを取ったほうがよいです。\nほんとうにしんどいの夫婦で助け合っていきましょう。</p>\n<h3 id=\"Try_PWA（同人版）で書けてないところがある\">Try PWA（同人版）で書けてないところがある</h3><p>2年近く前に書いたTry PWAの章の一部が書く書くと言って書けてません。\n思い出すたびに買ってくださった方に大変申し訳ない気持ちでいます。\nほんとうにすいません。</p>\n<p>フリーランスのときに書く予定でいたのですが、フリーランスのときもなんだかんだ時間がなく結局書けずじまいでいます。\n今でも書けたら書きたいという気持ちでいます。</p>\n<p>そこで考えているのがVue v3のコンポーネントの作り方みたいな同人誌を1冊作ろうかと計画しています。\nTry PWAを買ってくださっていた方に無料で配布できたらと思っています。<br>ただいかんせんマイホームを建てる準備をしていたり、育児をしていたりとかなり時間がありません。\nマイホームを建てるタスクが落ち着いたら、書く書く詐欺にならないように着手したいと考えています。</p>\n<p>ここでやってやるぞ宣言しておいて自分を追い込む作戦😇</p>\n<br>\n<br>\n\n<p>最近Twitterに現れることも少ないですが、こんな感じで頑張って生きてます。ではﾉｼ</p>","thumbnail":"","twitterCardType":"","createdAt":"2020-07-03"}